In [3]:
heroes= {
   "name": ["Wonder Woman", "Batman", "Superman"],
   "alterego": ["Diana Prince", "Bruce Wayne", "Clark Kent"],
   "power": ["lasso of truth", "money", "super strength"]
}

In [7]:
import pandas as pd

herodf= pd.DataFrame(heroes)

In [8]:
(herodf)

           name      alterego           power
0  Wonder Woman  Diana Prince  lasso of truth
1        Batman   Bruce Wayne           money
2      Superman    Clark Kent  super strength

In [9]:
herodf["power"]

0    lasso of truth
1             money
2    super strength
Name: power, dtype: object

In [10]:
(herodf["power"])

0    lasso of truth
1             money
2    super strength
Name: power, dtype: object

In [11]:
(herodf[["name", "alterego"]])

           name      alterego
0  Wonder Woman  Diana Prince
1        Batman   Bruce Wayne
2      Superman    Clark Kent

In [12]:
herodf.iloc[[1,2]]

       name     alterego           power
1    Batman  Bruce Wayne           money
2  Superman   Clark Kent  super strength

In [13]:
herodf.iloc[[1,2]]

       name     alterego           power
1    Batman  Bruce Wayne           money
2  Superman   Clark Kent  super strength

In [14]:
herodf.iloc[[1,2] ,2]

1             money
2    super strength
Name: power, dtype: object

In [15]:
herodf= herodf.set_index("name")
herodf

                  alterego           power
name
Wonder Woman  Diana Prince  lasso of truth
Batman         Bruce Wayne           money
Superman        Clark Kent  super strength

In [16]:
herodf.loc[["Wonder Woman", "Superman"], "power"]
herodf

                  alterego           power
name
Wonder Woman  Diana Prince  lasso of truth
Batman         Bruce Wayne           money
Superman        Clark Kent  super strength